#include <stdio.h>

int main() 
{
    system("chcp 65001");
    char text[100]; // Оголошуємо масив символів (рядок) на 100 елементів
    int i, count = 0; // i - для циклу, count - лічильник великих літер

    printf("Введіть рядок: ");
    fgets(text, sizeof(text), stdin); // Зчитуємо рядок з клавіатури

    // Проходимо по кожному символу рядка
    for (i = 0; text[i] != '\0'; i += 1) 
    {
        // Перевіряємо, чи символ - велика літера (A-Z)
        if (text[i] >= 'A' && text[i] <= 'Z') 
        {
            count++; // Якщо так, збільшуємо лічильник
        }
    }

    printf("Кількість великих літер у рядку: %d\n", count);

    return 0;
}